combined for fx:
 uni19_fx
eu20_fx
wc19doha_fx
wc15cott_fx
usopc_fx =

In [1]:
import pandas as pd
import numpy as np

In [2]:
clean_universiade2015fx= pd.read_csv('../../Cleaning/qual_events/women/clean_universiade2015fx.csv')
clean_euro15champ_fx= pd.read_csv('../../Cleaning/qual_events/women/clean_euro15champ_fx.csv')

In [3]:
fx_euro_championship18 = pd.read_csv('../../Cleaning/qual_events/women/clean_european_championship2018fx.csv')
fx_euro_championship21 = pd.read_csv('../../Cleaning/qual_events/women/clean_european_championship2021fx.csv')


pam14am_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_pan_american2014fx.csv')
euro19games_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_european_games2019fx.csv')

In [4]:
pac16fx = pd.read_csv('../../Cleaning/qual_events/women/clean_pacific_rim2016fx.csv')
bc15fx = pd.read_csv('../../Cleaning/qual_events/women/clean_british_championship2015fx.csv')
jesolo15fx = pd.read_csv('../../Cleaning/qual_events/women/clean_jesolo2015fx.csv')

In [5]:
wc13cott_fx = pd.read_csv('../..//Cleaning/qual_events/women/clean_wc13cott_fx.csv')
wc13doha_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_wc14doha_fx.csv')

In [6]:
fx_world_championship_w = pd.read_csv('../../Cleaning/World_Championships/fx_world_championship_w.csv')

In [7]:
wc15cott_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_worldcup2015cott_fx.csv')
wc19doha_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_worldcup2019doha_fx.csv')
eu20_fx = pd.read_csv('../../Cleaning/qual_events/women/euro2020fx.csv')
uni19_fx = pd.read_csv('../../Cleaning/qual_events/women/uni2019fx.csv')



# usopc_fx = pd.read_csv('../Cleaning/qual_events/clean_worldcup2015cott_ub.csv')
# usopc_fx = pd.read_csv('../Cleaning/qual_events/clean_worldcup2015cott_vt.csv')

In [8]:
# clean_worldcup2015cott_fx.csv
# clean_worldcup2015cott_ub.csv
# clean_worldcup2015cott_vt.csv

# clean_worldcup2019doha_bb.csv
# clean_worldcup2019doha_fx.csv
# clean_worldcup2019doha_ub.csv
# clean_worldcup2019doha_vt.csv

# euro2020bb.csv
# euro2020fx.csv
# euro2020ub.csv
# euro2020vt.csv

# uni2019bb.csv
# uni2019fx.csv
# uni2019ub.csv
# uni2019vt.csv

In [9]:
# usopc = pd.read_csv('../Cleaning/USOPC/usopc_women_october.csv')
usopc_fx = pd.read_csv('../../Cleaning/USOPC/usopc_women_fx_october.csv')
usopc_bb = pd.read_csv('../../Cleaning/USOPC/usopc_women_bb_october.csv')
usopc_ub = pd.read_csv('../../Cleaning/USOPC/usopc_women_ub_october.csv')
usopc_vt = pd.read_csv('../../Cleaning/USOPC/usopc_women_vt_october.csv')

In [10]:
usopc_fx.head(1)

,Name,Country,Gender,Date,Competition,Round,Apparatus,Rank,D_Score,E_Score,Penalty,Score
0,Jana ABDELSALAM,EGY,w,2022-11-06,2022 51st FIG Artistic Gymnastics World Champi...,qual,FX,109.0,4.4,7.466,0.1,11.766

In [11]:
uni19_fx.head(1)

   Rank                Athlete  D Score  E Score  Pen.  Total
0     1  Carlotta Ferlito(ITA)      5.3      7.9   NaN   13.2

In [12]:
eu20_fx.head(1)

   Position          Gymnast  D Score  E Score  Penalty  Total
0         1  Larisa Iordache      5.6     7.85      0.0  13.45

In [13]:
wc19doha_fx.head(1)

   Rank     Athlete         Nation    D      E   ND   Total  round  year  NOC
0     1  Jade Carey  United States  6.2  8.266  0.0  14.466  Final  2019  USA

In [14]:
wc15cott_fx.head(1)

   Rank              Athlete    D      E   ND   Total  round  year Nation
0     1  Marta Pihan-Kulesza  5.8  8.425  0.0  14.225  final  2015    POL

In [15]:
uni19_fx['Pen.'].fillna(0, inplace=True)

In [16]:
uni19_fx['nation'] = uni19_fx['Athlete'].str.extract(r'\((.*?)\)')

In [17]:
uni19_fx['Athlete'] = uni19_fx['Athlete'].str.replace(r'\(.*?\)', '', regex=True)

In [18]:
uni19_fx['year']=2019

In [19]:
eu20_fx['year']=2020

In [20]:
uni19_fx

   Rank               Athlete  D Score  E Score  Pen.  Total nation  year
0     1      Carlotta Ferlito      5.3     7.90   0.0  13.20    ITA  2019
1     2         Aiko Sugihara      5.3     7.70   0.0  13.00    JPN  2019
2     3   Uliana Perebinosova      4.7     8.00   0.0  12.70    RUS  2019
3     4  Farah Ann Abdul Hadi      4.6     7.95   0.0  12.55    MAS  2019
4     5       Hitomi Hatakeda      4.7     7.85   0.0  12.55    JPN  2019
5     6       Lilia Akhaimova      5.5     6.75   0.0  12.25    RUS  2019
6     7       Jessica Dowling      4.6     7.45   0.1  11.95    CAN  2019
7     8      Barbora Mokosova      4.7     7.10   0.0  11.80    SVK  2019

In [21]:
eu20_fx['nation']='eu'

In [22]:
eu20_fx

,Position,Gymnast,D Score,E Score,Penalty,Total,year,nation
0,1,Larisa Iordache,5.6,7.85,0.0,13.45,2020,eu
1,2,Göksu Üçtaş Şanlı,4.8,8.30,0.0,13.10,2020,eu
2,3,Lihie Raz,4.9,7.85,0.0,12.75,2020,eu
3,4,Diana Varinska,4.7,7.95,0.0,12.65,2020,eu
4,5,Antonia Duță,4.9,7.80,0.1,12.60,2020,eu
5,6,Angelina Radivilova,5.0,7.60,0.0,12.60,2020,eu
6,7,Zója Székely,4.4,8.10,0.3,12.20,2020,eu
7,8,Dorina Böczögő,4.9,7.20,0.0,12.10,2020,eu

In [23]:
eu20_fx.rename(columns={'Gymnast': 'Name', 'Position': 'Rank', 'Penalty': 'Pen.'}, inplace=True)

In [24]:
uni19_fx.rename(columns={'Athlete': 'Name', }, inplace=True)

In [25]:
uni19_fx['round']='final'

In [26]:
eu20_fx['round']='final'

In [27]:
eu20_fx.columns

Index(['Rank', 'Name', 'D Score', 'E Score', 'Pen.', 'Total', 'year', 'nation',
       'round'],
      dtype='object')

In [37]:
eu20_fx=eu20_fx[['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year']]

In [38]:
uni19_fx = uni19_fx[['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year']]

In [39]:
wc19doha_fx.head(1)

   Rank     Athlete         Nation    D      E   ND   Total  round  year  NOC
0     1  Jade Carey  United States  6.2  8.266  0.0  14.466  Final  2019  USA

In [40]:
wc19doha_fx=wc19doha_fx.drop(columns=["Nation"])

In [41]:
wc19doha_fx.rename(columns={'Athlete': 'Name', 
                            'NOC': 'nation', 'D': 'D Score',
                           'E': 'E Score', 'ND': 'Pen.'}, inplace=True)

In [42]:
wc19doha_fx.head()

,Rank,Name,D Score,E Score,Pen.,Total,round,year,nation
0,1,Jade Carey,6.2,8.266,0.0,14.466,Final,2019,USA
1,2,Lara Mori,5.6,7.833,0.0,13.433,Final,2019,ITA
2,3,Vanessa Ferrari,5.2,8.100,0.0,13.300,Final,2019,ITA
3,4,Marta Pihan-Kulesza,5.4,7.933,-0.1,13.233,Final,2019,POL
4,5,Marine Boyer,5.0,8.200,0.0,13.200,Final,2019,FRA

In [43]:
wc19doha_fx.columns

Index(['Rank', 'Name', 'D Score', 'E Score', 'Pen.', 'Total', 'round', 'year',
       'nation'],
      dtype='object')

In [44]:
wc19doha_fx=wc19doha_fx[['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 
                         'Total','year' , 'round' ]]

In [45]:
wc15cott_fx.head()

   Rank              Athlete    D      E   ND   Total  round  year Nation
0     1  Marta Pihan-Kulesza  5.8  8.425  0.0  14.225  final  2015    POL
1     2     Andreea Munteanu  5.5  8.325  0.0  13.825  final  2015    ROU
2     3       Filipa Martins  5.3  8.175  0.0  13.475  final  2015    POR
3     4      Ayelen Tarabini  5.3  8.125 -0.1  13.325  final  2015    ARG
4     5           Lisa Ecker  5.0  7.950  0.0  12.950  final  2015    AUT

In [46]:
wc15cott_fx.rename(columns={'Athlete': 'Name', 
                            'Nation': 'nation', 'D': 'D Score',
                           'E': 'E Score', 'ND': 'Pen.'}, inplace=True)

In [47]:
wc15cott_fx=wc15cott_fx[['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 
                         'Total','year' , 'round' ]]

In [48]:
usopc_fx.head(1)

,Name,Country,Gender,Date,Competition,Round,Apparatus,Rank,D_Score,E_Score,Penalty,Score
0,Jana ABDELSALAM,EGY,w,2022-11-06,2022 51st FIG Artistic Gymnastics World Champi...,qual,FX,109.0,4.4,7.466,0.1,11.766

In [49]:
usopc_fx=usopc_fx.drop(columns=["Gender", 'Competition', 'Apparatus', ])

In [50]:
usopc_fx["Date"].unique()

array(['2022-11-06', '2023-03-12', '2022-08-02', '2022-03-27',
       '2022-08-14', '2023-03-26', '2023-04-16', '2023-05-28',
       '2023-02-26', '2023-08-05', '2023-04-30', '2023-03-04',
       '2023-06-28', '2022-02-27', '2022-04-03', '2022-03-20',
       '2023-03-19', '2023-06-11', '2022-03-05', '2023-06-04'],
      dtype=object)

In [51]:
usopc_fx['year'] = usopc_fx['Date'].str[:4]

In [52]:
usopc_fx=usopc_fx.drop(columns=["Date"])

In [53]:
usopc_fx.columns

Index(['Name', 'Country', 'Round', 'Rank', 'D_Score', 'E_Score', 'Penalty',
       'Score', 'year'],
      dtype='object')

In [54]:
usopc_fx.rename(columns={'Country': 'nation', 'Round': 'round',
                           'E_Score': 'E Score','D_Score': 'D Score', 'Penalty': 'Pen.',
                        'Score': 'Total'}, inplace=True)

In [55]:
usopc_fx=usopc_fx[['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 
                         'Total','year' , 'round' ]]

In [56]:
usopc_fx.head(1)

    Rank             Name nation  D Score  E Score  Pen.   Total  year round
0  109.0  Jana ABDELSALAM    EGY      4.4    7.466   0.1  11.766  2022  qual

In [57]:
# uni19_fx
# eu20_fx
# wc19doha_fx
# wc15cott_fx
# usopc_fx =

In [58]:
combined_df = pd.concat([usopc_fx, wc15cott_fx, wc19doha_fx, eu20_fx, uni19_fx], axis=0)

In [59]:
fx = combined_df.copy()

In [60]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1335 entries, 0 to 7
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1335 non-null   float64
 1   Name     1335 non-null   object
 2   nation   1319 non-null   object
 3   D Score  1335 non-null   float64
 4   E Score  1335 non-null   float64
 5   Pen.     1335 non-null   float64
 6   Total    1335 non-null   float64
 7   year     1335 non-null   object
 8   round    1319 non-null   object
dtypes: float64(5), object(4)
memory usage: 104.3+ KB

In [61]:
fx['year'].unique()

array(['2022', '2023', 2015, 2019, 2020], dtype=object)

In [62]:
fx['year'] = fx['year'].astype(int)

In [63]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1335 entries, 0 to 7
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1335 non-null   float64
 1   Name     1335 non-null   object
 2   nation   1319 non-null   object
 3   D Score  1335 non-null   float64
 4   E Score  1335 non-null   float64
 5   Pen.     1335 non-null   float64
 6   Total    1335 non-null   float64
 7   year     1335 non-null   int64
 8   round    1319 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 104.3+ KB

In [64]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [65]:
fx.columns

Index(['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round'],
      dtype='object')

In [66]:
wc13doha_fx.head()

   Rank             Athlete Nation    D      E   ND   Score  round  year
0     1     Larisa Iordache    ROU  5.8  8.625  0.0  14.425  final  2014
1     2       Diana Bulimar    ROU  5.7  8.600  0.0  14.300  final  2014
2     3     Isabela Onyshko    CAN  5.5  8.325 -0.1  13.725  final  2014
3     4     Lauren Mitchell    AUS  5.5  8.075 -0.1  13.475  final  2014
4     5  Charlotte Sullivan    NZL  5.5  7.450  0.0  12.950  final  2014

In [67]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
wc13doha_fx.rename(columns=column_name_mapping, inplace=True)

In [68]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = wc13doha_fx[desired_column_order]

In [69]:
wc13doha_fx=df_rearranged.copy()

In [70]:
wc13doha_fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,1,Larisa Iordache,ROU,5.8,8.625,0.0,14.425,2014,final
1,2,Diana Bulimar,ROU,5.7,8.600,0.0,14.300,2014,final
2,3,Isabela Onyshko,CAN,5.5,8.325,-0.1,13.725,2014,final
3,4,Lauren Mitchell,AUS,5.5,8.075,-0.1,13.475,2014,final
4,5,Charlotte Sullivan,NZL,5.5,7.450,0.0,12.950,2014,final

In [71]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [72]:
wc13cott_fx.head()

   Rank            Athlete Nation    D      E   ND   Total  round  year
0     1       Maegan Chant    CAN  5.7  8.050  0.0  13.750  final  2013
1     2    Anna Dementyeva    RUS  5.8  7.875 -0.1  13.575  final  2013
2     3  Noel van Klaveren    NED  5.4  8.075  0.0  13.475  final  2013
3     4        Cagla Akyol    GER  5.3  8.000 -0.2  13.100  final  2013
4     5      Jessica Lopez    VEN  5.6  7.575 -0.3  12.875  final  2013

In [73]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
wc13cott_fx.rename(columns=column_name_mapping, inplace=True)

In [74]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = wc13cott_fx[desired_column_order]

In [75]:
wc13cott_fx=df_rearranged.copy()

In [76]:
wc13cott_fx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     34 non-null     int64
 1   Name     34 non-null     object
 2   nation   34 non-null     object
 3   D Score  34 non-null     float64
 4   E Score  34 non-null     float64
 5   Pen.     34 non-null     float64
 6   Total    34 non-null     float64
 7   year     34 non-null     int64
 8   round    34 non-null     object
dtypes: float64(4), int64(2), object(3)
memory usage: 2.5+ KB

In [77]:
wc13doha_fx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     34 non-null     int64
 1   Name     34 non-null     object
 2   nation   34 non-null     object
 3   D Score  34 non-null     float64
 4   E Score  34 non-null     float64
 5   Pen.     34 non-null     float64
 6   Total    34 non-null     float64
 7   year     34 non-null     int64
 8   round    34 non-null     object
dtypes: float64(4), int64(2), object(3)
memory usage: 2.5+ KB

In [78]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1335 entries, 0 to 7
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1335 non-null   float64
 1   Name     1335 non-null   object
 2   nation   1319 non-null   object
 3   D Score  1335 non-null   float64
 4   E Score  1335 non-null   float64
 5   Pen.     1335 non-null   float64
 6   Total    1335 non-null   float64
 7   year     1335 non-null   int64
 8   round    1319 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 104.3+ KB

In [79]:
combined_df = pd.concat([fx, wc13doha_fx,wc13cott_fx])

In [80]:
combined_df

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual
...,...,...,...,...,...,...,...,...,...
29,22.0,Roxana Popa,ESP,5.2,5.850,0.0,11.050,2013,qual
30,23.0,Nancy Mohamed Taman,EGY,5.0,6.000,-0.1,10.900,2013,qual
31,24.0,Ang Tracie,MAS,4.8,5.750,0.0,10.550,2013,qual
32,25.0,Mai Ahmed Saad,EGY,5.0,5.600,-0.4,10.200,2013,qual
33,26.0,Paula Tiitta,FIN,4.7,6.000,-0.7,10.000,2013,qual

In [81]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1403 entries, 0 to 33
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1403 non-null   float64
 1   Name     1403 non-null   object
 2   nation   1387 non-null   object
 3   D Score  1403 non-null   float64
 4   E Score  1403 non-null   float64
 5   Pen.     1403 non-null   float64
 6   Total    1403 non-null   float64
 7   year     1403 non-null   int64
 8   round    1387 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 109.6+ KB

In [82]:
fx = combined_df.copy()

In [83]:
fx

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual
...,...,...,...,...,...,...,...,...,...
29,22.0,Roxana Popa,ESP,5.2,5.850,0.0,11.050,2013,qual
30,23.0,Nancy Mohamed Taman,EGY,5.0,6.000,-0.1,10.900,2013,qual
31,24.0,Ang Tracie,MAS,4.8,5.750,0.0,10.550,2013,qual
32,25.0,Mai Ahmed Saad,EGY,5.0,5.600,-0.4,10.200,2013,qual
33,26.0,Paula Tiitta,FIN,4.7,6.000,-0.7,10.000,2013,qual

In [84]:
fx['nation'].fillna('none', inplace=True)

In [85]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1403 entries, 0 to 33
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1403 non-null   float64
 1   Name     1403 non-null   object
 2   nation   1403 non-null   object
 3   D Score  1403 non-null   float64
 4   E Score  1403 non-null   float64
 5   Pen.     1403 non-null   float64
 6   Total    1403 non-null   float64
 7   year     1403 non-null   int64
 8   round    1387 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 109.6+ KB

In [86]:
fx['year'].value_counts()

year
2023    647
2022    589
2019     46
2015     45
2014     34
2013     34
2020      8
Name: count, dtype: int64

# To ADD to df :
- wc19melbourne
- wc18jesolo

In [91]:
wc19melb_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_worldcup2019melbourne_fx.csv')
wc18jeso_fx = pd.read_csv('../../Cleaning/qual_events/women/clean_worldcup2018jesolo_fx.csv')

In [92]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [93]:
wc19melb_fx.head()

   Rank          Athlete Nation    D      E   ND   Total  round  year
0     1  Vanessa Ferrari    ITA  5.2  8.400  0.0  13.600  final  2019
1     2     Paula Mejias    PUR  4.7  7.833  0.0  12.533  final  2019
2     3     Zhao Shiting    CHN  5.1  7.266 -0.1  12.266  final  2019
3     4       Emma Nedov    AUS  4.9  7.333 -0.4  11.833  final  2019
4     5       Lai Pin-Ju    TPE  4.6  7.233 -0.1  11.733  final  2019

In [94]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
wc19melb_fx.rename(columns=column_name_mapping, inplace=True)

In [95]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = wc19melb_fx[desired_column_order]

In [96]:
wc19melb_fx=df_rearranged.copy()

In [97]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
wc18jeso_fx.rename(columns=column_name_mapping, inplace=True)

In [98]:
wc18jeso_fx['year']=2018
wc18jeso_fx['round']='final'

In [99]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = wc18jeso_fx[desired_column_order]

In [100]:
wc18jeso_fx=df_rearranged.copy()

In [101]:
combined_df = pd.concat([fx, wc19melb_fx,wc18jeso_fx])

In [102]:
 fx = combined_df.copy()

In [103]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1429 entries, 0 to 7
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1428 non-null   float64
 1   Name     1429 non-null   object
 2   nation   1429 non-null   object
 3   D Score  1429 non-null   float64
 4   E Score  1429 non-null   float64
 5   Pen.     1429 non-null   float64
 6   Total    1429 non-null   float64
 7   year     1429 non-null   int64
 8   round    1413 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 111.6+ KB

In [104]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [105]:
fx_world_championship_w.head()

,Position,Gymnast,D Score,E Score,Pen.,Total,year,Nation,round
0,1,Ksenia Afanasyeva,6.1,9.033,0.0,15.133,2011,RUS,final
1,2,Sui Lu,6.1,8.966,0.0,15.066,2011,CHN,final
2,3,Aly Raisman,6.1,8.900,0.0,15.000,2011,USA,final
3,4,Yao Jinnan,6.0,8.866,0.0,14.866,2011,CHN,final
4,5,Lauren Mitchell,6.3,8.433,0.0,14.733,2011,AUS,final

In [106]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Gymnast': 'Name',
    'Nation': 'nation',
    'Position': 'Rank',

    # Add more columns as needed
}

# Use the rename method to rename the columns
fx_world_championship_w.rename(columns=column_name_mapping, inplace=True)

In [107]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = fx_world_championship_w[desired_column_order]

In [108]:
fx_world_championship_w=df_rearranged.copy()

In [109]:
combined_df = pd.concat([fx, fx_world_championship_w])

In [110]:
 fx = combined_df.copy()

In [111]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1485 entries, 0 to 55
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1484 non-null   float64
 1   Name     1485 non-null   object
 2   nation   1461 non-null   object
 3   D Score  1485 non-null   float64
 4   E Score  1485 non-null   float64
 5   Pen.     1485 non-null   float64
 6   Total    1485 non-null   float64
 7   year     1485 non-null   int64
 8   round    1469 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 116.0+ KB

In [112]:
fx.duplicated().sum()

2

In [113]:
duplicates = fx.duplicated()

In [114]:
fx = fx.drop_duplicates()

In [115]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1483 entries, 0 to 55
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1482 non-null   float64
 1   Name     1483 non-null   object
 2   nation   1459 non-null   object
 3   D Score  1483 non-null   float64
 4   E Score  1483 non-null   float64
 5   Pen.     1483 non-null   float64
 6   Total    1483 non-null   float64
 7   year     1483 non-null   int64
 8   round    1467 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 115.9+ KB

In [116]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [117]:
pac16fx.head()

   Rank             Athlete Nation    D      E   ND   Total  year  round
0     1         Aly Raisman    USA  6.2  8.900  0.0  15.100  2016  final
1     2       Brenna Dowell    USA  5.9  8.925  0.0  14.825  2016  final
2     3       Shallon Olsen    CAN  6.1  8.300  0.0  14.400  2016  final
3     4         Nagi Kajita    JPN  5.7  8.250  0.0  13.950  2016  final
4     5  Georgia-Rose Brown    AUS  5.3  8.525  0.0  13.825  2016  final

In [118]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
pac16fx.rename(columns=column_name_mapping, inplace=True)

In [119]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = pac16fx[desired_column_order]

In [120]:
pac16fx=df_rearranged.copy()

In [121]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
jesolo15fx.rename(columns=column_name_mapping, inplace=True)

In [122]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = jesolo15fx[desired_column_order]

In [123]:
jesolo15fx=df_rearranged.copy()

In [124]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
bc15fx.rename(columns=column_name_mapping, inplace=True)

In [125]:
# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
df_rearranged = bc15fx[desired_column_order]

In [126]:
bc15fx=df_rearranged.copy()

In [127]:
combined_df = pd.concat([fx, bc15fx, jesolo15fx, pac16fx], axis=0)

In [128]:
fx = combined_df.copy()

In [129]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1507 entries, 0 to 7
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1505 non-null   float64
 1   Name     1507 non-null   object
 2   nation   1483 non-null   object
 3   D Score  1507 non-null   float64
 4   E Score  1507 non-null   float64
 5   Pen.     1507 non-null   float64
 6   Total    1507 non-null   float64
 7   year     1507 non-null   int64
 8   round    1491 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 117.7+ KB

In [130]:
fx.duplicated().sum()

0

In [131]:
fx.head()

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual

In [132]:
fx_euro_championship18.head(1)

   Rank           Athlete Nation    D      E   ND   Total  year  round
0     1  Jessica Gadirova    GBR  5.5  8.466  0.0  13.966  2021  final

In [133]:
fx_euro_championship21.head(1)

,Rank,Athlete,Nation,D,E,ND,Total,year,round
0,1,Melanie De Jesus Dos Santos,FRA,5.5,8.266,0.0,13.766,2021,final

In [134]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
fx_euro_championship18.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
fx_euro_championship18 = fx_euro_championship18[desired_column_order]

In [135]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
fx_euro_championship21.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
fx_euro_championship21 = fx_euro_championship21[desired_column_order]

In [136]:
combined_df = pd.concat([fx, fx_euro_championship21, fx_euro_championship18], axis=0)

In [137]:
fx=combined_df.copy()

In [138]:
fx.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1700 entries, 0 to 98
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1698 non-null   float64
 1   Name     1700 non-null   object
 2   nation   1676 non-null   object
 3   D Score  1700 non-null   float64
 4   E Score  1700 non-null   float64
 5   Pen.     1566 non-null   float64
 6   Total    1700 non-null   float64
 7   year     1700 non-null   int64
 8   round    1684 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 132.8+ KB

In [139]:
fx.fillna(0,inplace=True)

In [140]:
fx.duplicated().sum()

0

In [141]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
}

# Use the rename method to rename the columns
pam14am_fx.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
pam14am_fx = pam14am_fx[desired_column_order]

In [142]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
euro19games_fx.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
euro19games_fx = euro19games_fx[desired_column_order]

In [143]:
# pam14am_fx
# euro19games_fx

In [144]:
combined_df = pd.concat([fx, pam14am_fx, euro19games_fx], axis=0)

In [145]:
fx=combined_df.copy()

In [146]:
fx.duplicated().sum()

0

In [147]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
clean_universiade2015fx.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
clean_universiade2015fx = clean_universiade2015fx[desired_column_order]

In [148]:
# Create a dictionary to specify the column name changes
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'D': 'D Score',
    'E': 'E Score',
    'ND': 'Pen.',
    'Score': 'Total'
    # Add more columns as needed
}

# Use the rename method to rename the columns
clean_euro15champ_fx.rename(columns=column_name_mapping, inplace=True)


# Define the desired column order
desired_column_order = ['Rank', 'Name', 'nation', 'D Score', 'E Score', 'Pen.', 'Total', 'year',
       'round']

# Create a new DataFrame with the columns rearranged
clean_euro15champ_fx = clean_euro15champ_fx[desired_column_order]

In [149]:
combined_df = pd.concat([fx, clean_universiade2015fx, clean_euro15champ_fx], axis=0)

In [150]:
fx=combined_df.copy()

In [151]:
fx.duplicated().sum()

0

In [ ]:
# fx.to_csv('fx_w.csv', index=False)

In [152]:
fx

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
0,109.0,Jana ABDELSALAM,EGY,4.4,7.466,0.1,11.766,2022,qual
1,22.0,Jana ABDELSALAM,EGY,4.5,7.366,0.0,11.866,2023,qual
2,39.0,Kumudi Imanya ABEYRATNE,SRI,2.9,4.450,0.0,7.350,2022,qual
3,74.0,Jana ABOELHASAN,EGY,4.4,7.866,0.0,12.266,2022,qual
4,16.0,Ondine ACHAMPONG,GBR,5.3,8.033,0.0,13.333,2022,qual
...,...,...,...,...,...,...,...,...,...
82,75.0,Anastasiya Yekimenka,BLR,4.0,6.933,0.0,10.933,2015,qual
83,76.0,Mia Haerum,NOR,4.6,6.433,-0.1,10.933,2015,qual
84,77.0,Mariia Smirnova,AZE,4.0,7.200,-0.4,10.800,2015,qual
85,78.0,Claire Rose Azzopardi,MLT,3.6,7.200,0.0,10.800,2015,qual
86,79.0,Kirsty Caruana,MLT,4.4,6.033,0.0,10.433,2015,qual